[
   {
      "id":"1",
      "description":"This is an insult that is given instead of a reason.",
      "name":"Ad Hominem Abusive",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "I don't think dyslexia is a virus, Bill."
         },
         {
            "name": "Blathering Bill",
            "message": "You didn't even graduate from college so it makes sense you would think that. It is a virus."
         }
      ]
   },
   {
      "id":"2",
      "description":"This is an attempt to discredit the arguer by linking him or her to something or someone that is thought of in a negative way.",
      "name":"Ad Hominem Association",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "John is a scumbag."
         },
         {
            "name": "Rational Rob",
            "message": "Why?"
         },
         {
            "name": "Blathering Bill",
            "message": "Because I saw him hanging out with Rick and Rick is a scumbag."
         }
      ]
   },
   {
      "id":"3",
      "description":"This is an attack on the circumstances of the arguer. May imply ulterior motives or conflict of interests.",
      "name":"Ad Hominem Tu Quoque",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Rob says that cigarettes cause lung cancer but he smokes a pack a day. Smoking doesn't cause cancer!"
         }
      ]
   },
   {
      "id":"4",
      "description":"Where something is claimed to be true or good solely because lots of others believe it to be so.",
      "name":"Ad Populum Bandwagoning",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Bitcoin at 20k is a steal! I'm stocking up."
         },
         {
            "name": "Rational Rob",
            "message": "Have you given this invesment much thought?"
         },
         {
            "name": "Blathering Bill",
            "message": "No, but just look at the all the other people buying right now. What could possibly go wrong?"
         }
      ]
   },
   {
      "id":"5",
      "description":"The arguer tries to inflate the worth of his argument by associating it with a well known authority who is not an actual authority on the subject at hand. The arguer may also try to use his\/her own authority to persuade listeners.",
      "name":"Appeal to Authority",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "I can't wait to start the semester at the prestigious Trump University. I'm on the road to the promiseland!"
         },
         {
            "name": "Rational Rob",
            "message": "I don't think that school is even accredited. Isn't it more of a collection of weekend seminars inside of a hotel lobby than an actual university?"
         },
         {
            "name": "Blathering Bill",
            "message": "No. It's a real university and it's a great school. Donald Trump is rich and powerful. He wouldn't put his name on the line for something that doesn't work."
         }
      ]
   },
   {
      "id":"6",
      "description":"This is really just a threat. The arguer tries to get others to adopt his\/her point of view or else the arguer will cause them harm.",
      "name":"Appeal to Force",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "You better start liking Nickelback or I'll tell your wife that you cheated on her!"
         },
         {
            "name": "Rational Rob",
            "message": "Okay. Okay..."
         }
      ]
   },
   {
      "id":"7",
      "description":"Wherein judgment is based solely on whether the subject of judgment is \"natural\" or \"unnatural.\"",
      "name":"Appeal to Nature",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Maybe you should double check with your doctor before applying that arsenic to your wound..."
         },
         {
            "name": "Blathering Bill",
            "message": "It's a perfectly natural substance that isn't man-made. Don't worry. It's all good."
         }
      ]
   },
   {
      "id":"8",
      "description":"This form of argument tries to pursued the listener that an idea must be true because it has been believed or practiced for a long time.",
      "name":"Appeal to Tradition",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Do you really want your daughter going into prostitution?"
         },
         {
            "name": "Blathering Bill",
            "message": "It's the world's oldest profession. It couldn't have existed for this long if it wasn't a good profession."
         }
      ]
   },
   {
      "id":"9",
      "description":"The arguer claims priviliged knowledge of a questionable entity by claiming to be a victim of it (and thereby shielding himself from criticism).",
      "name":"Appeal to Victimization",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Santa Claus is real. I know because he woke me up last Christmas eve and forced me to help him deliver presents in the blistering cold. So, don't even ask me if I have proof! I have all the proof I need."
         },
         {
            "name": "Rational Rob",
            "message": "Okay..."
         }
      ]
   },
   {
      "id":"10",
      "description":"The arguer produces an overwhelming array of statements and\/or technical jargon in a relatively short period of time. The opponent is unable to address them all or even understand them. Observers will likely be impressed, but have no way of checking the validity of the claims. More often than not, the claims are untrue or aren't even relevant to what is being discussed.",
      "name":"Argumentum Verbosium",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Why do you want to deport me?"
         },
         {
            "name": "Blathering Bill",
            "message": "Well, we did it as a way to bring attention to the fact that we have all of these foreigners and the Russian government, the official Chinese government, now said political power goes out the barrel of a gun. It killed about 80 million people because he's the only guy that have the guns. So we did it to point out that this is globalism, and the mega banks that control the planet and brag that they've taken over in Bloomberg, AP, Reuters, you name it, brag that they're going to get our guns as well. They've taken everybody's guns but the Swiss and the American people. And when they get our guns, they can have their world tyranny while the government buys 1.6 billion bullets, armored vehicles, tanks, helicopters, predator drones, armed now in U.S. skies, being used to arrest people in North Dakota. The Second Amendment isn't there for duck hunting. It's there to protect us from tyrannical government and street thugs. Take the women in India. Your piece earlier on CNN I was watching during Anderson Cooper's show. Didn't tell you that the women of India have signed giant petitions to get firearms because the police can't and won't protect them. The answer is... Wait a minute. I have FBI crime statistics that come out a year late, 2011, 20-plus percent crime drop in the last nine years. Real violent crime because more guns means less crime. Britain took the guns 15, 16 years ago. Tripling of your overall violent crime. True we have a higher gun violence level, but overall, muggings, stabbings, deaths, you -- those men raped that woman in India to death with an iron rod four feet long. You can't ban the iron rods. The guns -- the iron rods, Piers, didn't do it, the tyrants did it. Hitler took the guns, Stalin took the guns, Mao took the guns. Fidel Castro took the guns. Hugo Chavez took the guns, and I'm here to tell you, 1776 will commence again if you try to take our firearms. It doesn't matter how many lemmings you get out there on the street begging for them to have their guns taken. We will not relinquish them. Do you understand? That why you're going to fail and the establishment knows no matter how much propaganda, the republic will rise again when you attempt to take our gun. My family in the Texas revolution in Santa Ana. My family was at the core on both sides starting left, because Santa Ana came to take the guns at Gonzalez, Texas."
         }
      ]
   },
   {
      "id":"11",
      "description":"Making a claim without offering any proof to substantiate it.",
      "name":"Baseless Claim",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "My new car gets 500 miles per gallon!"
         },
         {
            "name": "Rational Rob",
            "message": "Proof?"
         },
         {
            "name": "Blathering Bill",
            "message": "..."
         }
      ]
   },
   {
      "id":"12",
      "description":"The arguer gives the impression that there are only two extreme positions that are possible. This does not allow for moderate, middle grounds or grey areas.",
      "name":"Black or White",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "I'm really converned that the new tax increases imposed by the federal government will make it harder for me to make ends meet."
         },
         {
            "name": "Blathering Bill",
            "message": "America was built on the rule of law. If you don't like the new tax hikes then you can pack your bags and get the fuck out!"
         }
      ]
   },
   {
      "id":"13",
      "description":"The belief that destruction is economically befeficial because it will provide jobs to people who will rebuild what was destroyed. This fails to take into consideration all of the ways that the money could have been spent if it were not needed to rebuld what was destroyed.",
      "name":"Broken Window Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "I hope this hurricane that's headed our way next Friday is crazy big and destroys a lot of homes!"
         },
         {
            "name": "Rational Rob",
            "message": "Why?"
         },
         {
            "name": "Blathering Bill",
            "message": "I just lost my job again and I can sure use another one. This will boost economy. It'll give lots of people jobs rebuilding."
         }
      ]
   },
   {
      "id":"14",
      "description":"Instead of providing evidence to support a claim, the arguer implies that it is true because his\/her opponent has not proved it to be false. Extraordinary claims require extraordinary evidence' (Carl Sagan).",
      "name":"Burden of Proof",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Any plans for this weekend?"
         },
         {
            "name": "Blathering Bill",
            "message": "I'm going to search for that hidden treasure that's buried out in the desert that I was telling you about. Over $20 million in gold."
         },
         {
            "name": "Rational Rob",
            "message": "Are you even sure that such a thing exists?"
         },
         {
            "name": "Blathering Bill",
            "message": "Well, no one has been able to prove to me that isn't buried out there. Until someone does I'm just going to assume that it is."
         }
      ]
   },
   {
      "id":"15",
      "description":"The act of pointing at individual cases or data that seem to confirm a particular position, while ignoring a significant portion of related cases or data that may contradict that position.",
      "name":"Cherry Picking",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "They say that alcohol is bad for the liver but my dad started binge drinking at 14 and he never had a problem with his liver."
         }
      ]
   },
   {
      "id":"16",
      "description":"Providing what is essentially the conclusion of the argument as a premise.",
      "name":"Circular Reasoning",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Why is using drugs wrong?"
         },
         {
            "name": "Blathering Bill",
            "message": "Because it's illegal"
         },
         {
            "name": "Rational Rob",
            "message": "Why is it illegal?"
         },
         {
            "name": "Blathering Bill",
            "message": "Because it's wrong"
         }
      ]
   },
   {
      "id":"17",
      "description":"The composition fallacy is committed when one assumes that a quality of a thing can be determined by the quality of its individual parts.",
      "name":"Composition Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Your brain is made of molecules. Molecules do not have consciousness. Therefore, your brain cannot be the source of consciousness."
         }
      ]
   },
   {
      "id":"18",
      "description":"Improperly rejecting a claim for being imprecise.",
      "name":"Continuum Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "The temperature of the globe has only gone up a fration of a percent over the past 20 years and we haven't seen any catastrophic events. What's another few degrees gonna do?"
         }
      ]
   },
   {
      "id":"19",
      "description":"This is a combination of two fallacies; appeal to victimization and appeal to force. Typically, the role of the person who is using this fallacy will constanty shift between victim and aggressor. One minute, they'll claim to be a helpless victim and the next, they'll outright threaten you. The result is general confusion as the viewers will most likely not know which role is genuine.",
      "name":"Cry Bullying",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "You better loan me some money or else I'll move out and you'll have to find a new roommate."
         },
         {
            "name": "Rational Rob",
            "message": "What? Why do I have to loan you money?"
         },
         {
            "name": "Blathering Bill",
            "message": "I'm a quarter Native American and it's the least you can do for me considering how your people committed genocide against ingigenous people. Plus, you're a Redskins fan and that shirt with that logo on it really oppresses me."
         }
      ]
   },
   {
      "id":"20",
      "description":"The division fallacy is committed when one assumes that a quality of a thing's individual parts can be determined by the quality of the whole.",
      "name":"Division Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Food from Mexico is amazing! I hope our new roommate, Javier, can whip us up some good quesedillas."
         },
         {
            "name": "Rational Rob",
            "message": "Ugh"
         }
      ]
   },
   {
      "id":"21",
      "description":"The power of holding two contradictory beliefs in one's mind simultaneously, and accepting both of them.",
      "name":"Doublethink",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Our rights come from God and people need to stop trying to take them away."
         },
         {
            "name": "Rational Rob",
            "message": "I hear ya. The government has really trampled the rights of a lot of undocumented immigrants."
         },
         {
            "name": "Blathering Bill",
            "message": "They ain't Americans. So they don't have any rights here."
         },
         {
            "name": "Rational Rob",
            "message": "Aren't rights God given?"
         },
         {
            "name": "Blathering Bill",
            "message": "..."
         }
      ]
   },
   {
      "id":"22",
      "description":"This isn't a fallacy; it's just a very cruel and dishonest tactic. This happens when someone uses a tragedy to advance their narrative or for their own personal gain. The gains can vary and can range from mere attention on social media to money or favors. This happens a lot after school shooting in the United States. Using this fallacy typically indicates a clear lack of empathy on behalf of the person employing it.",
      "name":"Exploiting Tragedies",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "That's awful what happened to Peggy. Suicide can be prevented if people have access to good mental health treatment."
         },
         {
            "name": "Blathering Bill",
            "message": "Yeah, but remember what I told you about those liberals? Liberalism is a mental disorder and Peggy's death confirms that."
         }
      ]
   },
   {
      "id":"23",
      "description": "An inaccurate fact that is used to advance an argument.",
      "name":"Factual Inaccuracy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Trump's response to Hurricane Harvey may have sucked but Obama's response to Katrina in 2005 was bad too."
         },
         {
            "name": "Rational Rob",
            "message": "Pretty sure that Obama wasn't president in 2005."
         }
      ]
   },
   {
      "id":"24",
      "description":"This is a tricky one that skeptics have to be wary of. We may be tempted to claim that the conclusion of an argument is wrong because the arguer used a logical fallacy in his or her reasoning. Just because a fallacy was used does not mean that the conclusion is necessarily incorrect.",
      "name":"Fallacy Fallacy",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "I might need to adjust my diet. My doctor says that my cholesterol is up."
         },
         {
            "name": "Blathering Bill",
            "message": "Ha. Your doctor says so? That's an appeal to authority. Don't just listen to him because he's a doctor."
         }
      ]
   },
   {
      "id":"25",
      "description":"Describes a situation of logical and apparent equivalence, when in fact there is none.",
      "name":"False Equivalence",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Guns kill way too many people each year. They should be tougher to get."
         },
         {
            "name": "Blathering Bill",
            "message": "What about cars? Many more people die each year in car accidents. Should they be tougher to get too?"
         },
         {
            "name": "Rational Rob",
            "message": "Guns are designed to kill. Cars are designed to transport people from one place to another."
         }
      ]
   },
   {
      "id":"26",
      "description":"A rhetorical tactic that asserts that if your ideas are ridiculed, then they must be valid. This fallacy earns its name from Galileo‘s famous persecution at the hands of the Catholic Church for his defense of heliocentrism in the face of the orthodox Biblical literalism of the day.",
      "name":"Galileo's Gambit",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Let me tell you about my latest startup venture. It's an iPhone app that informs users of the closest cigarette butts on the sidewalk. It's exactly like Rebag just for used cigarettes instead of used hand bags."
         },
         {
            "name": "Rational Rob",
            "message": "Ha. Are you for real? That's crazy."
         },
         {
            "name": "Blathering Bill",
            "message": "Laugh all you want. They laughed at the Wright brothers too so I know I'm in good company."
         }
      ]
   },
   {
      "id":"27",
      "description":"The mistaken belief that a random event must be due to happen soon if it has not happened in an unusually long time.",
      "name":"Gambler's Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "I'm gonna order a new jacket just so I'm prepared for the blizzard that's header our way."
         },
         {
            "name": "Rational Rob",
            "message": "We live in Miami. It doesn't even snow here."
         },
         {
            "name": "Blathering Bill",
            "message": "My point exactly. It hasn't snowed here in so long that we're long overdue for a snow storm. A blizzard will be coming any day now..."
         }
      ]
   },
   {
      "id":"28",
      "description":"Discrediting the source or origin of an argument instead of the argument itself.",
      "name":"Genetic Fallacy",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Check out the article from the New York Times that I sent you. I'd like to hear your take."
         },
         {
            "name": "Blathering Bill",
            "message": "It ain't real. It's fake news."
         }
      ]
   },
   {
      "id":"29",
      "description":"This one doesn't appear on most lists of logical fallacies that are found on the internet and it isn't technically a fallacy. Although, it is a way of poisoning the well and discrediting someone. Godwin's law was first coined in 1990 by author and attorney Mike Godwin. It states that \"As an online discussion grows longer, the probability of a comparison involving Hitler approaches 1.\"\t",
      "name":"Godwin's Law",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "You should really quit smoking. You've developed a pretty nasty cough."
         },
         {
            "name": "Blathering Bill",
            "message": "Don't you know that it was the Nazis who were the first to recongize the link between smoking and poor health? Thanks, but I'll continue smoking..."
         }
      ]
   },
   {
      "id":"30",
      "description":"The arguer attributes a property to an entire group based only on observing that property in an individual.",
      "name":"Hasty Generalization",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "People from Salt Lake City sure are crazy. I had a roommate in college who was from there and she partied all the time."
         }
      ]
   },
   {
      "id":"31",
      "description":"A question posed that implies an unstated major premise such that any answer will trap the answerer into appearing to agree with the unstated premise.",
      "name":"Loaded Question",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "You still cheat on your wife, Bill?"
         },
         {
            "name": "Rational Rob",
            "message": "I never did in the first place."
         }
      ]
   },
   {
      "id":"32",
      "description":"The belief that technological progress that be slowed down or even halted so jobs will not be lost.",
      "name":"Luddite Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Never use ATM's or self-checkout machines at the supermarket."
         },
         {
            "name": "Rational Rob",
            "message": "Why? How come?"
         },
         {
            "name": "Blathering Bill",
            "message": "They take jobs away from tellers and cashiers."
         },
         {
            "name": "Rational Rob",
            "message": "Should I stop using email too because that takes jobs away from the post office?"
         }
      ]
   },
   {
      "id":"33",
      "description":"Assuming that the compromise between two positions is correct.",
      "name":"Middle Ground",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Scientists say that global warming is real but the guys down at the bodega say that it isn't. It's probably only half real..."
         }
      ]
   },
   {
      "id":"34",
      "description":"In which one assumes a 'holier-than-thou' attitude in an attempt to make oneself look good to win an argument.",
      "name":"Moral High Ground",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "AIDS is a man made disease. Trust me, I've volunteered at an AIDS clinic for years and I've helped plenty of sick children."
         }
      ]
   },
   {
      "id":"35",
      "description":"When criteria are met that falsify the arguer's position, the arguer changes the criteria and claims that his\/her position is still valid.",
      "name":"Moving the Goalposts",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "If evolution ins't real then how do humans become resistant to antibiotics over time?"
         },
         {
            "name": "Blathering Bill",
            "message": "Small amounts of evolution are possible. But, not a lot."
         }
      ]
   },
   {
      "id":"36",
      "description":"When arguing against an action or policy, this fallacy is committed if the arguer declares the action to be useless if it does not lead to ideal conditions. It is related to the false dichotomy in that it implies that if the action does not lead to perfection, then it is useless. It does not recognize that simple improvement is worthwhile. Essentially, if it isn't perfect, then it is useless.",
      "name":"Nirvana Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Why should murder be illegal? People still kill each other anyways."
         }
      ]
   },
   {
      "id":"37",
      "description":"If the premise of the argument is falsified with a counter example, rather than changing the conclusion, the arguer changes the definition of a major premise to make both the premise and the conclusion true. Typically, the arguer makes a sweeping generalization about a an entire group. This is usually done by implying that the group is bound and defined by the arbitrary quality. If an exception to this generalization is pointed out, the arguer dismisses the exception as not truly belonging to the group in the first place.",
      "name":"No True Scotsman",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "It is the duty of police officers to protect and serve with integrity and honesty. They would never break the law."
         },
         {
            "name": "Rational Rob",
            "message": "Really? Hundreds of cops get busted each and every year for corruption and brutality."
         },
         {
            "name": "Blathering Bill",
            "message": "They aren't real cops."
         }
      ]
   },
   {
      "id":"38",
      "description":"A precedes B, therefore A caused B.",
      "name":"Post Hoc Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "It's miracle! Just one day after I asked god to heal my sore throat it went away!"
         },
         {
            "name": "Rational Rob",
            "message": "Are you sure that it didn't have anything to do with visiting the doctor?"
         },
         {
            "name": "Blathering Bill",
            "message": "Nope. It was god!"
         }
      ]
   },
   {
      "id":"39",
      "description":"A type of non-sequitir whereby one asserts that if a group of people doesn't have a certain amount of a certain kind of person, that discrimination and\/or bigotry is the culprit.",
      "name":"Quota Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "It's super messed up that more than 80% of the people who are convicted of insider trading are white. The SEC is racist against white people."
         },
         {
            "name": "Rational Rob",
            "message": "Are you sure that's the reason?"
         }
      ]
   },
   {
      "id":"40",
      "description":"Refers to the selective excerpting of words from their original context in a way that distorts the source's intended meaning.",
      "name":"Quoting out of Context",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "I just want to quote from Einstein. 'Science without religion is lame, religion without science is blind.' From Steven Hawking: 'It would be very difficult to explain why the universe would have begun just this way, except as the act of a god who intended to create beings like us.'"
         },
         {
            "name": "Rational Rob",
            "message": "Wasn't Einstein an atheist?"
         },
         {
            "name": "Blathering Bill",
            "message": "Nope. I've got the quote right here."
         }
      ]
   },
   {
      "id":"41",
      "description":"A speaker attempts to distract an audience by deviating from the topic at hand by introducing a separate argument the speaker believes is easier to speak to.",
      "name":"Red Herring",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "It's wrong to steal from your neighbors. Don't you think you should stopit already?"
         },
         {
            "name": "Blathering Bill",
            "message": "But, who defines what is moral?"
         },
         {
            "name": "Rational Rob",
            "message": "As humans, we have an innate sense of morality that's built into all of us with the exception of psychopaths."
         },
         {
            "name": "Blathering Bill",
            "message": "Medication may help people with mental illness develop a sense of morality."
         }
      ]
   },
   {
      "id":"42",
      "description":"Conspiracy theory style reasoning wherein an argument is dismissed because the person who is putting it forth is assumed be profiting from the position that they're taking. This can also be an ad hominem attack. It's common for the person whose argument has been dismissed to be accused of being on a company's payroll. This assumes that the only legitimate reason one can have for taking a certain position is personal gain.",
      "name":"Shill Gambit",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Man! My head is killing me!"
         },
         {
            "name": "Rational Rob",
            "message": "Take a couple of aspirin pills. That should help."
         },
         {
            "name": "Blathering Bill",
            "message": "Ha! So you can collect some more dividends from Bayer?"
         }
      ]
   },
   {
      "id":"43",
      "description":"The arguer tries to convince others that one action will lead to a series of events that will eventually lead to an ultimate, usually unwanted, consequence. This is fallacious if it is unlikely that each intermediate step will necessarily follow the preceding one.",
      "name":"Slippery Slope Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Gays shouldn't be allowed to get married!"
         },
         {
            "name": "Rational Rob",
            "message": "Why not?"
         },
         {
            "name": "Blathering Bill",
            "message": "We've gotta draw the line somewhere. Before you know it, people will be given the right to marry children. Then their pets. And before you know it, they'll be marrying their cars."
         }
      ]
   },
   {
      "id":"44",
      "description":"The arguer attempts to explain a discrepancy in his\/her argument by assigning special properties to his\/her position that immunizes it from criticism. Special Pleading may render a claim unfalsifiable. The fallacy of Special Pleading occurs when someone argues that a case is an exception to a rule based upon an irrelevant characteristic that does not define an exception. Special Pleading also may occur when the arguer implies that opponents of his\/her point of view cannot possibly understand it because they lack the capacity or skills needed to comprehend it.",
      "name":"Special Pleading",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "You're totally wrong about that quote by Abraham Lincoln about not believing everything you read on the internet. That quote isn't real."
         },
         {
            "name": "Blathering Bill",
            "message": "There isn't any universal truth. Each person has their own version of the what's true."
         },
         {
            "name": "Rational Rob",
            "message": "...and you believe that to be true?"
         },
         {
            "name": "Blathering Bill",
            "message": "Yep"
         },
         {
            "name": "Rational Rob",
            "message": "I thought that nothing was universally true?"
         },
         {
            "name": "Blathering Bill",
            "message": "Well... except for that."
         }
      ]
   },
   {
      "id":"45",
      "description":"Giving the impression of refuting an opponent's argument, while actually refuting an argument that was not advanced by that opponent.",
      "name":"Strawman",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "The military receives way too much of the budget."
         },
         {
            "name": "Blathering Bill",
            "message": "You just hate America and don't care about protecting it!"
         }
      ]
   },
   {
      "id":"46",
      "description":"Cherry picking data that supports your contention while ignoring data that contradcits it. Basically, confirmation bias.",
      "name":"Texas Sharpshooter",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "My fortune teller told me that something positive was in my future in the form of a white piece of paper. Today, I received a letter in the mail telling me that all the charges against me have been dropped! She knows her stuff!"
         },
         {
            "name": "Rational Rob",
            "message": "Yeah... but she also talked about a million other things."
         },
         {
            "name": "Blathering Bill",
            "message": "So what!"
         },
         {
            "name": "Rational Rob",
            "message": "If you make enough predictions, then sooner or later some of them will probably become true. But, that's because of pure luck; not any uncanny ability to predict the future with accuracy."
         }
      ]
   },
   {
      "id":"47",
      "description":"A commonly used phrase, sometimes passing as folk wisdom, used to quell cognitive dissonance, conceal lack of thought-entertainment, move on to other topics etc. but in any case, end the debate with a cliché—not a point.",
      "name":"Thought Terminating Cliché",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "I can usually tolerate a lot, but your religious rituals are starting to affect me."
         },
         {
            "name": "Blathering Bill",
            "message": "It's a relationship; not a religion."
         }
      ]
   },
   {
      "id":"48",
      "description":"A type of non-sequitir whereby one attempts to take credit for the deeds of someone else who belongs to the same group of people as the person putting forth the argument.",
      "name":"Tribal Fallacy",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "I saw on your LinkedIn profile that you listed the creation of Facebook as one of your accomplishments. What's up with that?"
         },
         {
            "name": "Blathering Bill",
            "message": "Well, Mark and I have both worked as programmers."
         }
      ]
   },
   {
      "id":"49",
      "description":"When a person attempts to justify an action against another person because the other person did take or would take the same action against him or her.",
      "name":"Two Wrongs Make a Right",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "Did you contact the person whose ID was in that wallet that you found last night?"
         },
         {
            "name": "Blathering Bill",
            "message": "I'm not gonna return it."
         },
         {
            "name": "Rational Rob",
            "message": "Why not?"
         },
         {
            "name": "Blathering Bill",
            "message": "They would never contact me if they had found my wallet."
         }
      ]
   },
   {
      "id":"50",
      "description":"A claim that is asserted that cannot be proven wrong. No evidence suffices as valid evidence.",
      "name":"Unfalsifiable Claim",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "The leprechaun that's living in my closet is beginning to become a real pain in the ass."
         },
         {
            "name": "Rational Rob",
            "message": "I don't see any leprechaun in your closet."
         },
         {
            "name": "Blathering Bill",
            "message": "It's only visible to me and no one else."
         }
      ]
   },
   {
      "id":"51",
      "description":"This happens when someone changes the definition of a word in such a way that reality conforms to their biases or lies.",
      "name":"Word Redefinition",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "I think it's really messed up that you stole our neighbor's car a few nights ago."
         },
         {
            "name": "Blathering Bill",
            "message": "It wasn't stealing. My definition of stealing is when you take something that belongs to someone else without their permission and have no plan of returning it. I was going to return her car until I crashed it."
         }
      ]
   },
   {
      "id":"52",
      "description":"A deflection tactic that is used to shift the focus of attention away from what is being criticized on to other stuff that is totally irrelevant.",
      "name":"Whataboutism",
      "dialogue": [
         {
            "name": "Rational Rob",
            "message": "What's going on in Venezuela right now is awful."
         },
         {
            "name": "Blathering Bill",
            "message": "But, what about what's going on right here in America?"
         }
      ]
   },
   {
      "id":"53",
      "description":"This isn't any sort of coherent argument or rhetoric. However, it often masquerades as one if the person communicating it is well spoken. This is essentially just a confused or unintelligible mixture of seemingly random words and phrases.",
      "name":"Word Salad",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Orderliness imparts reality to a symbolic representation of acceptance."
         },
         {
            "name": "Rational Rob",
            "message": "What?"
         }
      ]
   },
   {
      "id":"54",
      "description":"When one assumes that someone else’s gain is a loss to other players; and the total amount of the available money or resources is fixed. A logical fallacy often occurs when this particular game theory is applied to economic or political discussions amongst non-economists – leading to false beliefs that the amount of wealth or jobs in the economy is fixed.",
      "name":"Zero Sum Fallacy",
      "dialogue": [
         {
            "name": "Blathering Bill",
            "message": "Is sure as hell hope that you lose your job soon!"
         },
         {
            "name": "Rational Rob",
            "message": "Why? What did I do to you?"
         },
         {
            "name": "Blathering Bill",
            "message": "You having a job and having more money than me means that I have less money, you greedy bastard."
         }
      ]
   }
]