[
    {
      "argument": "lowest-ever-black-unemployment",
      "contradictions": [
        {
          "argument": "the-welfare-state-destroyed-black-communities",
          "description": "How can it be the lowest black unemployment rate ever if it was supposedly so low back in the day?"
        }
      ],
      "description": "Donald Trump is responsible for achieving the lowest ever black unemployment rate",
      "examples": [
        "https://twitter.com/charliekirk11/status/1078130791513767936"
      ],
      "images": [
        "https://apnews.com/article/e1afa3f19a054540a7c34ca193bdd9ae/gallery/media:bba1835ca6914355bacb45e51ebc2659",
        "trump_economy_graph.jpg"
      ],
      "meme": "https://blather22.s3.amazonaws.com/memes/lowest-ever-black-unemployment.png",
      "tips": [
        "Donald Trump inherited a strong economy when he took office",
        "The black unemployment rate has been steadily decreasing since 2010",
        "The same is true for the number of food stamp recipients",
        "How is it that Donald Trump deserves credit for a trend that predates his presidency by seven years?",
        "Has this person given any credit to Barack Obama for lowering the black unemployment rate? If not, then why?"
      ]
    },
    {
      "argument": "the-welfare-state-destroyed-black-communities",
      "contradictions": [],
      "description": "Before the welfare state was introduced, black unemployment was lower than white unemployment",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/the-welfare-state-destroyed-black-communities.jpeg",
      "tips": []
    },
    {
      "argument": "stock-market-at-all-time-high",
      "contradictions": [],
      "description": "Donald Trump is responsible for a booming stock market",
      "examples": [],
      "images": [
        "obama-stock-market.jpg",
        "stock-market-all-time-high.jpg"
      ],
      "meme": "https://blather22.s3.amazonaws.com/memes/stock-market-at-all-time-high.jpeg",
      "tips": [
        "The stock market isn't the economy",
        "Figures like the unemployment rate, inflation rate, and GDP are much better indicators of how strong an economy is",
        "The stock market has been steadily increasing since the early 2010's",
        "How is it that Donald Trump deserves credit for a trend that predates his presidency by several years?",
        "Has this person given any credit to Barack Obama for increasing the stock market? If not, then why?"
      ]
    },
    {
      "argument": "trump-gave-up-his-billionaire-lifestyle",
      "contradictions": [],
      "description": "Donald Trump sacrificed his billionaire lifestyle to serve the American people",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/trump-gave-up-his-billionaire-lifestyle.jpg",
      "tips": [
        "Donald Trump didn't abandon his billionare lifestyle once he became president.",
        "He still retained his billionare status and also had the added luxury of being the most powerful person in the world"
      ]
    },
    {
      "argument": "obama-is-an-open-borders-marxist",
      "contradictions": [
        {
          "argument": "obama-built-the-concentration-camps",
          "description": "How was he an open borders marxist if he was so harsh on illegal immigration?"
        }
      ],
      "description": "Barack Obama was an open borders marxist who let illegal aliens flood over the border",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/obama-is-an-open-borders-marxist.jpeg",
      "tips": [
        "Countries with the strictest borders have historically been hardcore communist countries like East Germany, USSR, North Korea, China, and Cuba."
      ]
    },
    {
      "argument": "obama-built-the-concentration-camps",
      "contradictions": [
        {
          "argument": "obama-is-an-open-borders-marxist",
          "description": "Why did Obama deport so many people if he's an open borders marxist?"
        }
      ],
      "description": "Barack Obama deported more illegals than any other president",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/obama-built-the-concentration-camps.jpeg",
      "tips": [
        "This is just whataboutism",
        "Trump may have deported a lot of people but what about Obama?",
        "If the person making this argument is in favor of tougher immigration laws then shouldn't they like Obama?",
        "Statistically, more people were deported from the U.S. during Obama's presidency than during that of any other president",
        "That statistic was due in large part to a change in how \"deportations\" are defined rather than to an increase in the number of persons deported."
      ]
    },
    {
      "argument": "china-must-pay-for-covid",
      "contradictions": [
        {
          "argument": "its-just-the-flu-bro",
          "description": "If COVID is no worse than the seasonal flu then what exactly does China need to be held accountable for?"
        },
        {
          "argument": "anti-zionism-is-anti-semitism",
          "description": "If criticizing a country's government is the same as criticizing the citizens of that country as a group of human beings, then how is this argument not racist towards Chinese people?"
        }
      ],
      "description": "China must be held accountable for the deaths caused by COVID-19",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/china-must-pay-for-covid.jpg",
      "tips": [
        "This is thinly veiled racism",
        "It isn't logical or moral to hold all or most Chinese people accountable for the actions of other Chinese people just because they belong to the same race"
      ]
    },
    {
      "argument": "its-just-the-flu-bro",
      "contradictions": [
        {
          "argument": "china-must-pay-for-covid",
          "description": "If COVID is no worse than the seasonal flu then what exactly does China need to be held accountable for?"
        }
      ],
      "description": "COVID-19 has a 99% survival rate",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/its-just-the-flu-bro.jpg",
      "tips": [
        "If every American caught COVID and 99% of them survived, that would still translate to over 3 million deaths",
        "If 3 million Americans died from gun violence in Chicago, would the person making this argument remain unphased?",
        "If 3 million abortions were performed in America in one year, would the person making this argument person still care?"
      ]
    },
    {
      "argument": "states-rights-trump-federal-laws",
      "contradictions": [
        {
          "argument": "end-sanctuary-cities",
          "description": "If the federal government shouldn't be able to tamper with a state or local government's autonomy, then what difference should it make that sanctuary cities are in violation of federal law?"
        }
      ],
      "description": "States rights need to be protected against federal intrusion",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/states-rights-trump-federal-laws.jpg",
      "tips": [
        "The only time people even bother making this argument is when they disagree with a federal law",
        "If the federal law is one that they already agree with, then they'll argue that federal law reigns supreme",
        "Oppression is still oppression even if it's being committed by a local municipality instead of the federal government"
      ]
    },
    {
      "argument": "end-sanctuary-cities",
      "contradictions": [
        {
          "argument": "states-rights-trump-federal-laws",
          "description": "If the federal government shouldn't be able to tamper with a state or local government's autonomy, then what difference should it make that sanctuary cities are in violation of federal law?"
        },
        {
          "argument": "love-it-or-leave-it",
          "description": "If this person doesn't like the laws of a particular city, then can't they just move somewhere else?"
        },
        {
          "argument": "never-sacrifice-liberty-for-security",
          "description": "Violating local laws in an effort to make cities safer seems to ignore this quote from Benjamin Franklin"
        }
      ],
      "description": "Sanctuary cities are in violation of federal law",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/end-sanctuary-cities.jpg",
      "tips": [
        "Immigrants commit less crimes than native-born Americans",
        "Would any of the crimes committed by undocumented immigrants be any less tragic if they were committed by native born white men?",
        "If not, then why is their immigration status relevant to the discussion?",
        "If a deep red state like Texas decided to adopt lax gun laws that violated federal firearms laws, would the person using this argument be okay with that? Why or why not?"
      ]
    },
    {
      "argument": "law-and-order",
      "contradictions": [
        {
          "argument": "defy-lockdown-orders",
          "description": "If law and order is such an important part of America's moral fabric, then why is it considered patriotic to defy lockdown orders and mask madates? Why is this person afforded the luxury of being able to break the law while others aren't?"
        }
      ],
      "description": "Law and order must be respected",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/law-and-order.jpg",
      "tips": [
        "Everyone is in favor of law and order when the laws serve to benefit them",
        "If you're only going to appeal to the law when it's advantageous for you to do so then don't bother doing it all"
      ]
    },
    {
      "argument": "defy-lockdown-orders",
      "contradictions": [
        {
          "argument": "law-and-order",
          "description": "Obeying the law is important unless it's a law that I don't like. Then it's communism."
        }
      ],
      "description": "Lockdown orders should be disobeyed",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/defy-lockdown-orders.jpeg",
      "tips": [
        "People who use this argument will try to split hairs and say that there's a huge difference between things like orders, mandates, laws, legistlation, bills and so on",
        "In reality, it's just a petty semantics game. It's a way to help ease the cognitive dissonance that comes along with blatantly disobeying the law after years of appealing to it"
      ]
    },
    {
      "argument": "confederate-statues-erasing-history",
      "contradictions": [
        {
          "argument": "party-of-the-kkk",
          "description": "Why is this person defending the "
        }
      ],
      "description": "Tearing down Confederate statues is erasing history",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/confederate-statues-erasing-history.jpg",
      "tips": [
        "The statues would be placed in museums; not destroyed",
        "People would still learn about history through books and classes"
      ]
    },
    {
      "argument": "party-of-the-kkk",
      "contradictions": [
        {
          "argument": "party-that-hates-white-ppl",
          "description": "How can it be the party of white supremacy if it's also the party that is biased against white people?"
        },
        {
          "argument": "confederate-statues-erasing-history",
          "description": "Really strange how the people who use this argument are also the ones who are first in line to protect Confederate monuments"
        }
      ],
      "description": "The DemoKKKrats are the REAL white supremacists.",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/party-of-the-kkk.jpg",
      "tips": [
        "The two parties switched in the 1960's",
        "Most people who use this argument know that it's complete bullshit",
        "If they sincerely believed it then they wouldn't fight so hard to preserve Confederate statues"
      ]
    },
    {
      "argument": "party-that-hates-white-ppl",
      "contradictions": [
        {
          "argument": "party-of-the-kkk",
          "description": "How can it be the party of white supremacy if it's also the party that is biased against white people?"
        }
      ],
      "description": "The Democratic party has an anti-white agenda",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/party-that-hates-white-ppl.jpg",
      "tips": [

      ]
    },
    {
      "argument": "trump-deserves-credit-for-vaccine",
      "contradictions": [
        {
          "argument": "covid-vaccine-is-dangerous",
          "description": "Why does Trump deserve credit for something that isn't safe? Would you hold it against Trump if anyone developed dangerous side effects after taking the vaccine? Why or why not?"
        }
      ],
      "description": "Donald Trump deserves credit for developing a vaccine in such a short amount of time",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/trump-deserves-credit-for-vaccine.jpg",
      "tips": [
        "Donald Trump has no medical credentials",
        "Donald Trump was an anti-vaxxer prior to becoming president",
        "Steven Crowder even admits this"
      ]
    },
    {
      "argument": "covid-vaccine-is-dangerous",
      "contradictions": [
        {
          "argument": "trump-deserves-credit-for-vaccine",
          "description": "Why does Trump deserve credit for something that isn't safe? Would you hold it against Trump if anyone developed dangerous side effects after taking the vaccine? Why or why not?"
        }
      ],
      "description": "The COVID-19 vaccine is dangerous and possibly a ploy by Bill Gates and Anthony Fauci to implant us all with microchips",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/covid-vaccine-is-dangerous.jpg",
      "tips": [
        "The COVID-19 vaccine has earned the FDA's seal of approval",
        "The COVID-19 vaccine has been tested and peer reviewed by thousands of independent scientists and they're all coming to the same conclusion: the vaccine is safe"
      ]
    },
    {
      "argument": "gun-control-does-not-work",
      "contradictions": [
        {
          "argument": "ban-abortion",
          "description": "If people will always find ways to circumvent the law then how will banning abortions stop them from happening?"
        }
      ],
      "description": "Criminals will always find ways to get guns even if they're illegal",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/gun-control-does-not-work.png",
      "tips": [
        "France, Germany, Britain, Belgium, the Netherlands, Australia, New Zealand, and Japan all have much stricter gun control and their rates of violent crime are much lower"
      ]
    },
    {
      "argument": "ban-abortion",
      "contradictions": [
        {
          "argument": "gun-control-does-not-work",
          "description": "If abortion bans are effective then how come gun bans aren't?"
        },
        {
          "argument": "defend-the-constitution",
          "description": "A woman's right to have an abortion is protected by the 14th amendment"
        }
      ],
      "description": "If abortion is outlawed, few, if any, women will get them",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/ban_abortion_not_guns.jpg",
      "tips": [
        "Many of the people who use this argument have more empathy for a five day old clump of cells than they do for actual living, breathing adults"
      ]
    },
    {
      "_comment1": "Add 1964 Civil Rights bill as contradiction",
      "argument": "private-businesses-can-refuse-service",
      "contradictions": [
        {
          "argument": "big-tech-is-censoring-conservatives",
          "description": "Big tech companies are private entities. Why should they be forced to host content that runs contrary to their core beliefs?"
        }
      ],
      "description": "Private businesses reserve the right to refuse service for any reason",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/private-businesses-can-refuse-service.jpg",
      "tips": [
        "Many who use this argument will do a complete 180 as soon as they become personally affected by private entity refusing to do business with them",
        "Should businesses still reserve the right to refuse service to people of certain races or ethnicities?"
      ]
    },
    {
      "argument": "big-tech-is-censoring-conservatives",
      "contradictions": [
        {
          "argument": "private-businesses-can-refuse-service",
          "description": "Big tech companies are private entities. Why should they be forced to host content that runs contrary to their core beliefs?"
        },
        {
          "argument": "you-arent-entitled-to-anything",
          "description": "You aren't entitled to anything... except for a platform"
        }
      ],
      "description": "Private tech companies are obligated to host my content",
      "examples": [],
      "images": [],
      "meme": [
        "https://blather22.s3.amazonaws.com/memes/big-tech-is-censoring-conservatives.jpg",
        "https://blather22.s3.amazonaws.com/memes/speaking-the-truth.jpg"
      ],
      "tips": [
        "No one is under any obligation to provide a service to a total stranger",
        "Especially if that stranger is abusing that service by posting misinformation and baseless conspiracies",
        "People who use this argument like to play up the whole \"I'm being censored for speaking the TRUTH!\" angle and place themselves in the same league as genuinely heroic thinkers like Galileo and Socrates",
        "Most people who get banned from social media aren't banned because they're dishing out such hard-hitting, nunanced criticisms of complex political theory that the big tech oligarchs are shitting their pants and have to silence them",
        "Most people get banned because they're posting batshit crazy conspiracies about satanic pedo rings being run from the basements of obscure pizza parlors",
        "Aristotle and Plato these people are not"
      ]
    },
    {
      "argument": "repeal-section-230",
      "contradictions": [],
      "description": "Section 230 needs to be repealed",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/repeal-section-230.jpg",
      "tips": [
        "Section 230 is what prevents tech companies from being held liable for threats and calls to violence that are hosted on their platforms",
        "Getting rid of section 230 would give tech companies even more of an incentive to crack down on stuff like fake news and hate speech"
      ]
    },
    {
      "argument": "california-is-a-third-world-country",
      "contradictions": [],
      "description": "California is a socialist shit hole",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/california-is-a-third-world-country.png",
      "tips": [
        "California is the world's fifth largest economy",
        "There are more millionaires in California than there are in any other state in America",
        "The reason that California has such a high homeless population is because of something that isn't even related to politics",
        "California's warm and dry weather ensures that it never snows and rarely rains",
        "That makes it much easier to be homeless there than it would be in a place like Massachusetts or Minnesota",
        "Ask the person who uses this argument which laws in particular make California socialist and how they differ from laws in other states"
      ]
    },
    {
      "argument": "europe-is-a-socialist-shit-hole",
      "contradictions": [
        {
          "argument": "europe-is-more-capitalist-than-america",
          "description": "How can Europe be a socialist shit hole if it's more capitalist than America?"
        }
      ],
      "description": "Europe is a socialist shit hole",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/europe-is-a-socialist-shit-hole.jpg",
      "tips": [
        "Socialism isn't when the government provides health care or finances paternity leave",
        "Socialism is when the workers own the means of production",
        "None of the countries in Europe meet the criteria for being socialist",
        "Conservatives even admit this when they're in full blown 'own the libs' mode"
      ]
    },
    {
      "argument": "europe-is-more-capitalist-than-america",
      "contradictions": [
        {
          "argument": "europe-is-a-socialist-shit-hole",
          "description": "How can Europe have more economic freedom than America if it's a socialist shit hole?"
        }
      ],
      "description": "Europe has more economic freedom than America",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/europe-is-more-capitalist-than-america.jpg",
      "tips": [
        "Conservatives have never been able to come up with satisfactory answer to the Scandinavian question",
        "Sometimes they'll take this approach and actually admit that Europe has a lot going for it",
        "But, with one condition: Europe's success is largely the result of capitalism and not socialism",
        "The problem is that this argument contradicts what many right-wing pundits have been saying about Europe for years now about how it's a socialst shit hole"
      ]
    },
    {
      "argument": "back-the-blue",
      "contradictions": [
        {
          "argument": "kamala-is-a-cop",
          "description": "Always back the blue... until you don't"
        }
      ],
      "description": "Back the blue",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/back-the-blue.jpg",
      "tips": [
        "Bootlicking and worshipping authority doesn't make someone strong; it makes them a bitch"
      ]
    },
    {
      "argument": "kamala-is-a-cop",
      "contradictions": [
        {
          "argument": "back-the-blue",
          "description": "If you're someone who backs the blue, why is Kamala being a cop a bad thing?"
        }
      ],
      "description": "Kamala Harris is a cop",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/kamala-is-a-cop.jpg",
      "tips": [
        "Kamala Harris did work for many years as a district attorney in San Francisco",
        "Her record as DA has been spotty",
        "She's locked up people for smoking drugs that she has confessed to smoking herself",
        "She purposely kept some prisoners locked up solely to use them as cheap labor"
      ]
    },
    {
      "argument": "basic-biology",
      "contradictions": [
        {
          "argument": "jesus-rose-from-the-dead",
          "description": "A virgin giving birth to someone who would later die and then come back to life again is not consistent with biology"
        }
      ],
      "description": "There are only two genders. It's basic biology",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/basic-biology.jpg",
      "tips": [
        "This isn't what most biologists say about gender",
        "This argument is really just concern trolling",
        "Most people who will use this argument don't have any sincere appreciation for biology, or any other area of science, for that matter"
      ]
    },
    {
      "argument": "jesus-rose-from-the-dead",
      "contradictions": [
        {
          "argument": "basic-biology",
          "description": "Someone coming back from the dead isn't consistent with biology"
        }
      ],
      "description": "Jesus rose from the dead",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/jesus-rose-from-the-dead.jpg",
      "tips": [
        "Dead people don't come back to life",
        "It's a pity that some functioning adults need to have this explained to them",
        "It doesn't happen now even with all of the advances in medicine and technology",
        "It certainly didn't happen thousands of years ago"
      ]
    },
    {
      "argument": "feminism-is-cancer",
      "contradictions": [
        {
          "argument": "islam-treats-women-like-second-class-citizens",
          "description": "If feminism is such a bad thing then shouldn't American conservatism and Islam be compatible in at least one respect?"
        }
      ],
      "description": "Feminism is cancer",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/feminism-is-cancer.jpg",
      "tips": [
        "Feminism is just the idea that women and men should be treated equally"
      ]
    },
    {
      "argument": "islam-treats-women-like-second-class-citizens",
      "contradictions": [
        {
          "argument": "feminism-is-cancer",
          "description": ""
        }
      ],
      "description": "Islam treats women like second class citizens",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/islam-treats-women-like-second-class-citizens.jpg",
      "tips": [
        "This is precsely why feminists fight for women's rights",
        "Only to be mocked and ridiculed by conservative men who pretend to support women's rights whenever the topic of Islamic immigration is broached"
      ]
    },
    {
      "argument": "nazis-were-socialists",
      "contradictions": [],
      "description": "The nazis were socialists",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/nazis-were-socialists.png",
      "tips": [
        "The Democratic People's Republic of Korea isn't really democratic even though the word \"democratic\" is in the country's name",
        "The IRA aren't a group of Republicans just because the word \"Republican\" is in the name",
        "There are literally hundreds of counter examples to this argument"
      ]
    },
    {
      "argument": "the-left-are-anarchists",
      "contradictions": [
        {
          "argument": "the-left-wants-to-replace-god-with-government",
          "description": "So they're anarchists but also worship government like it's a god? Anarchists don't support any government"
        }
      ],
      "description": "The left are a bunch of violent anarchists",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/the-left-are-anarchists.jpg",
      "tips": [
        ""
      ]
    },
    {
      "argument": "the-left-wants-to-replace-god-with-government",
      "contradictions": [
        {
          "argument": "the-left-are-anarchists",
          "description": "So they worship government like it's a god but also don't believe in the concept of government?"
        }
      ],
      "description": "The left wants to replace god with government",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/the-left-wants-to-replace-god-with-government.jpg",
      "tips": [
        "Worshipping government isn't a prerequisite for wanting affordable health care or decent services in exchange for paying taxes"
      ]
    },
    {
      "argument": "communism-as-catch-all-term",
      "contradictions": [],
      "description": "Communism is when stuff happens that I don't like",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/communism-as-catch-all-term.jpeg",
      "tips": [
        "Words like \"fascism\", \"communism\", \"socialism\", and \"totalitarianism\" are used as catch-all terms to describe any and all situations where the government does stuff that they don't like",
        "Sort of like how teenagers in the 2000's would use the word \"gay\" to describe any person, place, or event that they didn't like. \"That's so gay!\""
      ]
    },
    {
      "argument": "defend-the-constitution",
      "contradictions": [
        {
          "argument": "taxation-is-theft",
          "description": "Maybe these self-proclaimed constitutionalists have never heard of the 16th amendment?"
        },
        {
          "argument": "end-birthright-citizenship",
          "description": "Maybe they've never heard of the 14th?"
        },
        {
          "argument": "ban-abortion",
          "description": "Maybe they still haven't gotten the news the Supreme Court ruled that a woman's right to have an abortion is protected by the 14th amendment"
        }
      ],
      "description": "Defend the constitution",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/defend-the-constitution.png",
      "tips": [
        "Most people who claim to have a fond appreciation for the constitution have never even read it",
        "Their knowledge of anything related to the constitition is limited to whatever platitudes are currently being regurgitated by their favorite talking heads"
      ]
    },
    {
      "argument": "taxation-is-theft",
      "contradictions": [
        {
          "argument": "defend-the-constitution",
          "description": "The 16th amendment grants the federal government the authority to collect income tax"
        },
        {
          "argument": "back-the-blue",
          "description": "If taxation is theft then why are conservatives so opposed to the idea of defunding the police? How do they think police departments are funded?"
        }
      ],
      "description": "Taxation is theft",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/taxation-is-theft.jpeg",
      "tips": [
        "Then let's stop funding police departments that kill unarmed people and get away with it"
      ]
    },
    {
      "argument": "end-birthright-citizenship",
      "contradictions": [
        {
          "argument": "defend-the-constitution",
          "description": "Birthright citizenship is protected by the 14th amendment"
        }
      ],
      "description": "End birthright citizenship",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/end-birthright-citizenship.png",
      "tips": [
        "Thinly veiled racism",
        "Most wouldn't even think twice about granting citizenship to children born here if the children were white"
      ]
    },
    {
      "argument": "rights-come-from-god",
      "contradictions": [
        {
          "argument": "undocumented-immigrants-dont-have-any-rights",
          "description": "If rights come from god and not government, then how does someone's passport determine what rights they have?"
        }
      ],
      "description": "Rights come from god",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/rights-come-from-god.jpg",
      "tips": [
        "If rights aren't granted by governments, then how does this person even know that rights exist?",
        "Rights aren't tangible. They can't be seen or touched or anything",
        "How does the person making this argument know that they have a right to keep what they've earned?",
        "What proof do they have that rights exist independent of governments?"
      ]
    },
    {
      "argument": "undocumented-immigrants-dont-have-any-rights",
      "contradictions": [
        {
          "argument": "undocumented-immigrants-dont-have-any-rights",
          "description": "If rights come from god and not government, then how does someone's passport determine what rights they have?"
        }
      ],
      "description": "Undocumented immigrants don't have any rights because they aren't citizens",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/undocumented-immigrants-dont-have-any-rights.png",
      "tips": [
        "Every human has rights"
      ]
    },
    {
      "argument": "china-covered-up-covid",
      "contradictions": [
        {
          "argument": "trump-downplayed-covid-for-good-reasons",
          "description": ""
        }
      ],
      "description": "China kept COVID-19 a secret and more people died as a result",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": []
    },
    {
      "argument": "trump-downplayed-covid-for-good-reasons",
      "contradictions": [
        {
          "argument": "china-covered-up-covid",
          "description": ""
        }
      ],
      "description": "Donald Trump purposely downplayed the risks of COVID-19 to prevent panic and it was the right thing to do",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/trump-downplayed-covid-for-good-reasons.jpg",
      "tips": []
    },
    {
      "argument": "turn-something-into-the-dmv",
      "contradictions": [],
      "description": "Having the government run something will turn it into the DMV",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/turn-something-into-the-dmv.png",
      "tips": [
        "This is an obvious straw man",
        "People who want the government to run health care want hospitals to be staffed with the best doctors, surgeons, nurses, and so on",
        "No one who wants universal health care wants desk jockies and DMV flunkies to be in charge of running health care"
      ]
    },
    {
      "argument": "love-it-or-leave-it",
      "contradictions": [
        {
          "argument": "fix-your-problems-in-your-own-country",
          "description": "Stay here? Move somewhere else? Pick on"
        }
      ],
      "description": "If you don't love America then leave",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/love-it-or-leave-it.png",
      "tips": [
        "Does the person making this argument like all of the laws in America? The ones about guns? The ones about taxes? The ones about welfare?",
        "If not, then why does this person still live in America? Why haven't they left?"
      ]
    },
    {
      "argument": "fix-your-problems-in-your-own-country",
      "contradictions": [
        {
          "argument": "love-it-or-leave-it",
          "description": "Stay here? Move somewhere else? Pick one"
        }
      ],
      "description": "Fix your own country instead of moving to another one",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/fix-your-problems-in-your-own-country.jpg",
      "tips": [
        "If the pilgrims had this attitude, would America even exist today?"
      ]
    },
    {
      "argument": "low-iq",
      "contradictions": [],
      "description": "You have low IQ",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/low-iq.jpg",
      "tips": [
        "People with high IQs generally don't brag about their IQs",
        "If you're truly intelligent, you shouldn't have to go aroung telling others that you're intelligent. Intelligence is something that's more demonstrated than said.",
        "People who brag about their supposed high IQs or who put others down for supposedly having low IQs are almost certainly projecting",
        "Anyone who uses this argument almost definitely has a case of Dunning-Kruger"
      ]
    },
    {
      "argument": "minimum-wage-kills-job",
      "contradictions": [
        {
          "argument": "someone-i-dont-like-had-stuff-made-in-a-sweat-shop",
          "description": ""
        }
      ],
      "description": "Higher minimum wage laws are socialist and kill jobs",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/minimum-wage-kills-job.png",
      "tips": [
        "Automation isn't necessarily a bad thing",
        "Arguing that higher minimum wage kills jobs is like arguing that ATMs put bank tellers out of work",
        "Technology will continue to advance regardless of how high the minimum wage is"
      ]
    },
    {
      "argument": "someone-i-dont-like-had-stuff-made-in-a-sweat-shop",
      "contradictions": [
        {
          "argument": "minimum-wage-kills-job",
          "description": "If minimum wage is socialist and kills jobs then isn't Colin Kaepernick doing something good by giving jobs to workers in sweatshops?"
        }
      ],
      "description": "Someone I don't like had their products made in a sweat shop",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/someone-i-dont-like-had-stuff-made-in-a-sweat-shop.jpg",
      "tips": [
        "This is grade A concern trolling",
        "Many who use this argument are opposed to the concept of a minimum wage",
        "But, if someone like Colin Kaepernick has his clothing made in sweatshops, then those same people who oppose minimum wage suddenly become concerned about exploitation and workers' rights...",
        "They're not objecting to sweatshops. They're objecting to who is using them.",
        "When it was revealed that some of Trump's clothing was made in China, there was absolutely no concern for the people who worked in sweatshops"
      ]
    },
    {
      "argument": "you-put-locks-on-your-front-doors",
      "contradictions": [],
      "description": "You keep the doors on your home locked but support open borders",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/you-put-locks-on-your-front-doors.jpg",
      "tips": [
        "Homes and countries aren't the same things",
        "This should be obvious to almost everyone",
        "A person can own a home and the owner can decide who gets to come in and out of his/her property",
        "A person cannot own a country"
      ]
    },
    {
      "argument": "slap-in-the-face-to-legal-immigrants",
      "contradictions": [
        {
          "argument": "socialism-creates-equal-misery",
          "description": "They're concerned that the cruelty of America's immigration system can't be extended to those who come illegally, more than anything."
        }
      ],
      "description": "Amnesty is a slap in the face to all of those who waited to become citizens legally",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/slap-in-the-face-to-legal-immigrants.jpg",
      "tips": [
        "This is an appeal to suffering",
        "It's like saying that the underground railroad was a bad thing because of all the slaves who waited to be legally emancipated"
      ]
    },
    {
      "argument": "socialism-creates-equal-misery",
      "contradictions": [
        {
          "argument": "slap-in-the-face-to-legal-immigrants",
          "description": ""
        }
      ],
      "description": "Socialism ensures that everyone is equally miserable",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/socialism-creates-equal-misery.png",
      "tips": []
    },
    {
      "argument": "cancel-culture",
      "contradictions": [
        {
          "argument": "boycott-this-company",
          "description": "Boycotting a company is essentially trying to cancel it. Why are some people able to cancel but not others?"
        }
      ],
      "description": "Cancel culture",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/cancel-culture.jpg",
      "tips": [
        "The people who complain the most about cancel culture are usually the most eager to cancel others",
        "Sort of like how Haggard's law tells us that the people who are the most vocally opposed to homosexuality are the ones who are most likely to get busted in a cheap motel room with a male escort"
      ]
    },
    {
      "argument": "exploiting-tragedies",
      "contradictions": [],
      "description": "Exploiting tragedies",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": []
    },
    {
      "argument": "vets-before-illegals",
      "contradictions": [
        {
          "argument": "you-arent-entitled-to-anything",
          "description": ""
        }
      ],
      "description": "Vets before illegals",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/vets-before-illegals.jpg",
      "tips": [
        "People who use this argument only care about homeless vets when it's politically convenient",
        "Most proponents of this argument oppose spending more money to help the homeless and tend to think of people who collect welfare as moochers and junkies"
      ]
    },
    {
      "argument": "you-arent-entitled-to-anything",
      "contradictions": [
        {
          "argument": "vets-before-illegals",
          "description": "Why are homeless vets more deserving of compassion than undocumented immigrants if no one is entitled to anything?"
        }
      ],
      "description": "You aren't entitled to anything",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/you-arent-entitled-to-anything.jpeg",
      "tips": [
        "This is a completely vacuous thing to say",
        "There isn't a single thing that human beings are entitled to? Not one?",
        "Likely projection on behalf of the person saying it",
        "They're entitled but feel guilty about it so they unload that anger on to easy targets as a way of assuaging their guilt"
      ]
    },
    {
      "argument": "free-speech",
      "contradictions": [],
      "description": "Free speech",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/free-speech.jpg",
      "tips": []
    },
    {
      "argument": "democratic-party-is-communist",
      "contradictions": [
        {
          "argument": "democratic-party-is-the-corporate-party",
          "description": ""
        }
      ],
      "description": "The Democratic party is embracing communism",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/democratic-party-is-communist.jpg",
      "tips": []
    },
    {
      "argument": "democratic-party-is-the-corporate-party",
      "contradictions": [
        {
          "argument": "democratic-party-is-communist",
          "description": ""
        }
      ],
      "description": "The Democratic party is the corporate party",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": []
    },
    {
      "argument": "identity-politics-is-cancer",
      "contradictions": [
        {
          "argument": "look-at-all-these-non-white-republicans",
          "description": ""
        }
      ],
      "description": "Identity politics is cancer",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": []
    },
    {
      "argument": "look-at-all-these-non-white-republicans",
      "contradictions": [
        {
          "argument": "identity-politics-is-cancer",
          "description": ""
        }
      ],
      "description": "Look at all of these non-white Republicans",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/look-at-all-these-non-white-republicans.jpg",
      "tips": []
    },
    {
      "argument": "weed-should-be-legal-so-im-cant-be-a-republican",
      "contradictions": [],
      "description": "Weed should be legal. How could I be a Republican?",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": [
        "Supporting weed legalization would have earned you some progressive clout if it were still 1967 you were kicking it in Haight-Ashbury",
        "But, it's 2020 and even Mississippi, of all states, has decriminalized marijuana",
        "If you want some bonafide left wing cred nowadays, you need to do a lot more than just support legalizing weed",
        "A lot of people who use this argument think that supporting weed legalization is a license to spew conservative talking points ad nauseam without ever being called out"
      ]
    },
    {
      "argument": "boycott-this-company",
      "contradictions": [
        {
          "argument": "cancel-culture",
          "description": "Boycotting something is essentially trying to cancel it"
        }
      ],
      "description": "Boycott this company",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/boycott-this-company.jpeg",
      "tips": [
        "As of 2021, conservatives have boycotted Netlix, Gillette, the NFL, the NBA, TikTok, Goodyear, Starbucks, Budweiser, Keurig, Nike, CNN, HBO"
      ]
    },
    {
      "argument": "never-sacrifice-liberty-for-security",
      "contradictions": [
        {
          "argument": "build-the-wall-to-keep-us-safe",
          "description": ""
        }
      ],
      "description": "Those who sacrifice liberty for security deserve neither",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": []
    },
    {
      "argument": "build-the-wall-to-keep-us-safe",
      "contradictions": [
        {
          "argument": "never-sacrifice-liberty-for-security",
          "description": ""
        }
      ],
      "description": "Build a wall to keep us safe from violent illegal aliens",
      "examples": [],
      "images": [],
      "meme": "",
      "tips": []
    },
    {
      "argument": "ppl-are-dying-to-be-victims",
      "contradictions": [
        {
          "argument": "coming-out-as-conservative-is-harder-than-coming-out-as-gay",
          "description": "If victimhood is so toxic then why are some conservatives competing alongside gay people in the oppression olympics?"
        }
      ],
      "description": "So many people are dying to be a victim",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/ppl-are-dying-to-be-victims.jpeg",
      "tips": [
        "Many people are legitimate victims of oppression",
        "Being expected to wear a mask in order to prevent the spread of infectious diseases is not oppression",
        "Censoring misinformation that has the potential to have real world consequences is not oppression"
      ]
    },
    {
      "argument": "coming-out-as-conservative-is-harder-than-coming-out-as-gay",
      "contradictions": [
        {
          "argument": "ppl-are-dying-to-be-victims",
          "description": "Why even bother making this argument if you're oppossed to things like victim culture?"
        }
      ],
      "description": "Conservatives are more persecuted today than gay people were in the 1980's",
      "examples": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/coming-out-as-conservative-is-harder-than-coming-out-as-gay.jpg",
      "tips": [
        "Conservatives never had to fight for the right to marry or not get fired because of their sexuality",
        ""
      ]
    },
    {
      "argument": "oppression-olympics",
      "contradictions": [
        {
          "argument": "illegals-have-not-suffered-as-much-as-others",
          "description": ""
        }
      ],
      "description": "Liberals always want to win the oppression olympics",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/oppression-olympics.jpg",
      "tips": []
    },
    {
      "argument": "illegals-have-not-suffered-as-much-as-holocaust-victims",
      "contradictions": [
        {
          "argument": "oppression-olympics",
          "description": "Why should it matter which group has suffered more? It's not like this is supposed to be a competition."
        }
      ],
      "description": "Illegals haven't suffered as much as holocaust victims have therefore they have no right to complain",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/illegals-have-not-suffered-as-much-as-holocaust-victims.jpg",
      "tips": []
    },
    {
      "argument": "anti-zionism-is-anti-semitism",
      "contradictions": [
        {
          "argument": "i-dont-hate-chinese-ppl-i-hate-the-chinse-gov",
          "description": "If criticizing a country's government is the same as criticizing the citizens of that country as a group of human beings, then is criticizing the CCP racist towards Chinese people?"
        }
      ],
      "description": "Anti-zionism is synonymous with anti-semitism",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/anti-zionism-is-anti-semitism.jpg",
      "tips": [
        "Hating a government isn't the same thing as hating the people who live under that government"
      ]
    },
    {
      "argument": "i-dont-hate-chinese-ppl-i-hate-the-chinse-gov",
      "contradictions": [
        {
          "argument": "anti-zionism-is-anti-semitism",
          "description": ""
        }
      ],
      "description": "I don't hate Chinese people, I hate the Chinese government",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/i-dont-hate-chinese-ppl-i-hate-the-chinse-gov.jpg",
      "tips": []
    },
    {
      "argument": "america-is-not-a-democracy",
      "contradictions": [],
      "description": "America is not a democracy. It's a republic.",
      "examples": [],
      "images": [],
      "meme": "https://blather22.s3.amazonaws.com/memes/america-is-not-a-democracy.png",
      "tips": [
        "This is like saying LeBron James is NOT an athlete. He's a basketball player. Learn the difference",
        "There actually isn't much of a difference. A constitutional republic is a kind of democracy"
      ]
    }
]
